Revit 2024 API
RebarShapeVertex Methods
The RebarShapeVertex type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetConstraints
 Retrieve the list of constraints associated with this vertex.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetConstraints
 Assign a new list of constraints to this vertex.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace